*** src/resources/sse_parser.rs:34:37: replace <= with > in parse_next_event

*** mutation diff:
--- src/resources/sse_parser.rs
+++ replace <= with > in parse_next_event
@@ -26,17 +26,17 @@
 /// after `data:` is stripped (and only one — `"data:  x"` keeps one leading space).
 pub(crate) fn parse_next_event(buffer: &mut String) -> Option<SseEvent> {
     loop {
         // SSE events end with a blank line. Look for either CR LF CR LF or LF LF; pick
         // whichever appears earliest in the buffer.
         let crlf = buffer.find("\r\n\r\n");
         let lf = buffer.find("\n\n");
         let (idx, sep_len) = match (crlf, lf) {
-            (Some(c), Some(l)) if c <= l => (c, 4),
+            (Some(c), Some(l)) if c > /* ~ changed by cargo-mutants ~ */ l => (c, 4),
             (Some(c), None) => (c, 4),
             (_, Some(l)) => (l, 2),
             (None, None) => return None,
         };
 
         let raw_event = buffer[..idx].to_string();
         buffer.drain(..idx + sep_len);

---- resources::sse_parser::tests::crlf_picked_when_earlier_than_lf stdout ----

thread 'resources::sse_parser::tests::crlf_picked_when_earlier_than_lf' (1877624) panicked at src/resources/sse_parser.rs:151:9:
assertion `left == right` failed
  left: [Data("first\nsecond")]
 right: [Data("first"), Data("second")]

---- resources::sse_parser::tests::lf_picked_when_earlier_than_crlf stdout ----

thread 'resources::sse_parser::tests::lf_picked_when_earlier_than_crlf' (1877633) panicked at src/resources/sse_parser.rs:134:9:
assertion `left == right` failed
  left: [Data("short\nlong-with-cr")]
 right: [Data("short"), Data("long-with-cr")]

failures:
    resources::sse_parser::tests::crlf_picked_when_earlier_than_lf
    resources::sse_parser::tests::lf_picked_when_earlier_than_crlf

test result: FAILED. 22 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
