*** src/resources/sse_parser.rs:41:28: replace + with * in parse_next_event

*** mutation diff:
--- src/resources/sse_parser.rs
+++ replace + with * in parse_next_event
@@ -33,17 +33,17 @@
         let (idx, sep_len) = match (crlf, lf) {
             (Some(c), Some(l)) if c <= l => (c, 4),
             (Some(c), None) => (c, 4),
             (_, Some(l)) => (l, 2),
             (None, None) => return None,
         };
 
         let raw_event = buffer[..idx].to_string();
-        buffer.drain(..idx + sep_len);
+        buffer.drain(..idx * /* ~ changed by cargo-mutants ~ */ sep_len);
 
         let mut data = String::new();
         for line in raw_event.split('\n').map(strip_trailing_cr) {
             if line.is_empty() {
                 continue;
             }
             if line.starts_with(':') {
                 // Comment line — ignore.

---- resources::sse_parser::tests::comment_only_buffer_returns_none_after_drain stdout ----

thread 'resources::sse_parser::tests::comment_only_buffer_returns_none_after_drain' (1884960) panicked at src/resources/sse_parser.rs:41:16:
range end index 20 out of range for slice of length 12

---- resources::sse_parser::tests::back_to_back_data_then_done stdout ----

thread 'resources::sse_parser::tests::back_to_back_data_then_done' (1884957) panicked at src/resources/sse_parser.rs:41:16:
range end index 12 out of range for slice of length 8

---- resources::sse_parser::tests::buffer_emptied_after_full_consumption stdout ----

thread 'resources::sse_parser::tests::buffer_emptied_after_full_consumption' (1884958) panicked at src/resources/sse_parser.rs:41:16:
range end index 14 out of range for slice of length 9

failures:
    resources::sse_parser::tests::back_to_back_data_then_done
    resources::sse_parser::tests::buffer_emptied_after_full_consumption
    resources::sse_parser::tests::comment_lines_ignored
    resources::sse_parser::tests::comment_only_buffer_returns_none_after_drain
    resources::sse_parser::tests::crlf_picked_when_earlier_than_lf
    resources::sse_parser::tests::crlf_separator
    resources::sse_parser::tests::crlf_separator_does_not_leak_stray_cr_lf
    resources::sse_parser::tests::done_followed_by_trailing_garbage_keeps_garbage_in_buffer
    resources::sse_parser::tests::done_terminator
    resources::sse_parser::tests::done_with_extra_whitespace_around
    resources::sse_parser::tests::empty_event_skipped_then_real_event_returned
    resources::sse_parser::tests::event_and_id_fields_ignored

test result: FAILED. 2 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
