*** src/resources/sse_parser.rs:58:20: delete ! in parse_next_event

*** mutation diff:
--- src/resources/sse_parser.rs
+++ delete ! in parse_next_event
@@ -50,17 +50,17 @@
                 continue;
             }
             // Split into field name + value at the first colon.
             let (field, value) = match line.split_once(':') {
                 Some((f, v)) => (f, strip_one_leading_space(v)),
                 None => (line, ""),
             };
             if field == "data" {
-                if !data.is_empty() {
+                if  /* ~ changed by cargo-mutants ~ */data.is_empty() {
                     data.push('\n');
                 }
                 data.push_str(value);
             }
             // Other field names (`event`, `id`, `retry`) — ignored. OpenAI doesn't use them.
         }
 
         if data.is_empty() {

---- resources::sse_parser::tests::comment_lines_ignored stdout ----

thread 'resources::sse_parser::tests::comment_lines_ignored' (1891793) panicked at src/resources/sse_parser.rs:174:9:
assertion `left == right` failed
  left: [Data("\nreal")]
 right: [Data("real")]

---- resources::sse_parser::tests::crlf_picked_when_earlier_than_lf stdout ----

thread 'resources::sse_parser::tests::crlf_picked_when_earlier_than_lf' (1891795) panicked at src/resources/sse_parser.rs:151:9:
assertion `left == right` failed
  left: [Data("\nfirst"), Data("\nsecond")]
 right: [Data("first"), Data("second")]

---- resources::sse_parser::tests::back_to_back_data_then_done stdout ----

thread 'resources::sse_parser::tests::back_to_back_data_then_done' (1891791) panicked at src/resources/sse_parser.rs:343:9:
assertion `left == right` failed
  left: [Data("\nhi"), Data("\n[DONE]")]
 right: [Data("hi"), Done]

failures:
    resources::sse_parser::tests::back_to_back_data_then_done
    resources::sse_parser::tests::comment_lines_ignored
    resources::sse_parser::tests::crlf_picked_when_earlier_than_lf
    resources::sse_parser::tests::crlf_separator
    resources::sse_parser::tests::crlf_separator_does_not_leak_stray_cr_lf
    resources::sse_parser::tests::done_followed_by_trailing_garbage_keeps_garbage_in_buffer
    resources::sse_parser::tests::done_terminator
    resources::sse_parser::tests::done_with_extra_whitespace_around
    resources::sse_parser::tests::empty_event_skipped_then_real_event_returned
    resources::sse_parser::tests::event_and_id_fields_ignored
    resources::sse_parser::tests::json_payload_with_embedded_colons_intact
    resources::sse_parser::tests::lf_picked_when_earlier_than_crlf

test result: FAILED. 4 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
