*** src/resources/sse_parser.rs:70:17: replace == with != in parse_next_event

*** mutation diff:
--- src/resources/sse_parser.rs
+++ replace == with != in parse_next_event
@@ -62,17 +62,17 @@
             }
             // Other field names (`event`, `id`, `retry`) — ignored. OpenAI doesn't use them.
         }
 
         if data.is_empty() {
             // Empty event (e.g. comment-only or all unknown fields) — keep scanning.
             continue;
         }
-        if data == "[DONE]" {
+        if data != /* ~ changed by cargo-mutants ~ */ "[DONE]" {
             return Some(SseEvent::Done);
         }
         return Some(SseEvent::Data(data));
     }
 }
 
 fn strip_trailing_cr(s: &str) -> &str {
     s.strip_suffix('\r').unwrap_or(s)

---- resources::sse_parser::tests::crlf_separator stdout ----

thread 'resources::sse_parser::tests::crlf_separator' (1895214) panicked at src/resources/sse_parser.rs:110:9:
assertion `left == right` failed
  left: Some(Done)
 right: Some(Data("hi"))

---- resources::sse_parser::tests::done_followed_by_trailing_garbage_keeps_garbage_in_buffer stdout ----

thread 'resources::sse_parser::tests::done_followed_by_trailing_garbage_keeps_garbage_in_buffer' (1895216) panicked at src/resources/sse_parser.rs:195:9:
assertion `left == right` failed
  left: Some(Data("[DONE]"))
 right: Some(Done)

---- resources::sse_parser::tests::crlf_separator_does_not_leak_stray_cr_lf stdout ----

thread 'resources::sse_parser::tests::crlf_separator_does_not_leak_stray_cr_lf' (1895215) panicked at src/resources/sse_parser.rs:123:9:
assertion `left == right` failed
  left: [Done, Done]
 right: [Data("a"), Data("b")]

failures:
    resources::sse_parser::tests::back_to_back_data_then_done
    resources::sse_parser::tests::comment_lines_ignored
    resources::sse_parser::tests::crlf_picked_when_earlier_than_lf
    resources::sse_parser::tests::crlf_separator
    resources::sse_parser::tests::crlf_separator_does_not_leak_stray_cr_lf
    resources::sse_parser::tests::done_followed_by_trailing_garbage_keeps_garbage_in_buffer
    resources::sse_parser::tests::done_terminator
    resources::sse_parser::tests::done_with_extra_whitespace_around
    resources::sse_parser::tests::empty_event_skipped_then_real_event_returned
    resources::sse_parser::tests::event_and_id_fields_ignored
    resources::sse_parser::tests::json_payload_with_embedded_colons_intact
    resources::sse_parser::tests::lf_picked_when_earlier_than_crlf

test result: FAILED. 4 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
