*** src/resources/sse_parser.rs:82:5: replace strip_one_leading_space -> &str with "xyzzy"

*** mutation diff:
--- src/resources/sse_parser.rs
+++ replace strip_one_leading_space -> &str with "xyzzy"
@@ -74,17 +74,17 @@
     }
 }
 
 fn strip_trailing_cr(s: &str) -> &str {
     s.strip_suffix('\r').unwrap_or(s)
 }
 
 fn strip_one_leading_space(s: &str) -> &str {
-    s.strip_prefix(' ').unwrap_or(s)
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn drain_all(mut buf: String) -> (Vec<SseEvent>, String) {
         let mut out = Vec::new();

---- resources::sse_parser::tests::done_followed_by_trailing_garbage_keeps_garbage_in_buffer stdout ----

thread 'resources::sse_parser::tests::done_followed_by_trailing_garbage_keeps_garbage_in_buffer' (1908887) panicked at src/resources/sse_parser.rs:195:9:
assertion `left == right` failed
  left: Some(Data("xyzzy"))
 right: Some(Done)

---- resources::sse_parser::tests::back_to_back_data_then_done stdout ----

thread 'resources::sse_parser::tests::back_to_back_data_then_done' (1908880) panicked at src/resources/sse_parser.rs:343:9:
assertion `left == right` failed
  left: [Data("xyzzy"), Data("xyzzy")]
 right: [Data("hi"), Done]

---- resources::sse_parser::tests::crlf_picked_when_earlier_than_lf stdout ----

thread 'resources::sse_parser::tests::crlf_picked_when_earlier_than_lf' (1908884) panicked at src/resources/sse_parser.rs:151:9:
assertion `left == right` failed
  left: [Data("xyzzy"), Data("xyzzy")]
 right: [Data("first"), Data("second")]

failures:
    resources::sse_parser::tests::back_to_back_data_then_done
    resources::sse_parser::tests::comment_lines_ignored
    resources::sse_parser::tests::crlf_picked_when_earlier_than_lf
    resources::sse_parser::tests::crlf_separator
    resources::sse_parser::tests::crlf_separator_does_not_leak_stray_cr_lf
    resources::sse_parser::tests::done_followed_by_trailing_garbage_keeps_garbage_in_buffer
    resources::sse_parser::tests::done_terminator
    resources::sse_parser::tests::done_with_extra_whitespace_around
    resources::sse_parser::tests::empty_event_skipped_then_real_event_returned
    resources::sse_parser::tests::event_and_id_fields_ignored
    resources::sse_parser::tests::json_payload_with_embedded_colons_intact
    resources::sse_parser::tests::lf_picked_when_earlier_than_crlf

test result: FAILED. 4 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
