*** src/logoi/input/tool/serialise/parse_obj.rs:17:5: replace parse_obj -> Result<serde_json::Map<String, Value>, String> with Ok(Default::default())

*** mutation diff:
--- src/logoi/input/tool/serialise/parse_obj.rs
+++ replace parse_obj -> Result<serde_json::Map<String, Value>, String> with Ok(Default::default())
@@ -9,44 +9,17 @@
     let obj = parse_obj(obj)?;
     for (key, value) in obj {
         param_map.insert(key, value);
     }
     Ok(())
 }
 
 pub fn parse_obj(obj: &Vec<FunctionParameter>) -> Result<serde_json::Map<String, Value>, String> {
-    let (fields_map, required_params) = match parse_fields(obj) {
-        Ok((fields_map, required_params)) => (fields_map, required_params),
-        Err(e) => return Err(e),
-    };
-
-    let mut obj: serde_json::Map<String, Value> = serde_json::Map::new();
-    obj.insert(
-        "type".to_string(),
-        serde_json::Value::String("object".to_string()),
-    );
-    obj.insert(
-        "properties".to_string(),
-        serde_json::Value::Object(fields_map),
-    );
-
-    // if !required_params.is_empty() {
-    obj.insert(
-        "required".to_string(),
-        serde_json::Value::Array(
-            required_params
-                .into_iter()
-                .map(serde_json::Value::String)
-                .collect(),
-        ),
-    );
-    // }
-
-    Ok(obj)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_fields(
     fields: &Vec<FunctionParameter>,
 ) -> Result<(serde_json::Map<String, Value>, Vec<String>), String> {
     let mut fields_map = serde_json::Map::new();
     let mut required_params = Vec::new();
     for param in fields {

---- map_always_emits_additional_properties stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'map_always_emits_additional_properties' (1930338) panicked at tests/proptest_function_schema.rs:260:9:
assertion `left == right` failed
  left: Null
 right: "object"

thread 'map_always_emits_additional_properties' (1930338) panicked at tests/proptest_function_schema.rs:192:1:
Test failed: assertion `left == right` failed
  left: Null
 right: "object".
minimal failing input: inner = String
	successes: 0

---- required_false_excludes_from_required_array stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'required_false_excludes_from_required_array' (1930340) panicked at tests/proptest_function_schema.rs:238:63:
called `Option::unwrap()` on a `None` value

thread 'required_false_excludes_from_required_array' (1930340) panicked at tests/proptest_function_schema.rs:238:63:
called `Option::unwrap()` on a `None` value

thread 'required_false_excludes_from_required_array' (1930340) panicked at tests/proptest_function_schema.rs:238:63:
called `Option::unwrap()` on a `None` value

thread 'required_false_excludes_from_required_array' (1930340) panicked at tests/proptest_function_schema.rs:238:63:
called `Option::unwrap()` on a `None` value

---- oneof_emits_correct_array stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'oneof_emits_correct_array' (1930339) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1930339) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1930339) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1930339) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

failures:
    arbitrary_function_call_serializes_to_valid_schema
    map_always_emits_additional_properties
    oneof_emits_correct_array
    required_false_excludes_from_required_array

test result: FAILED. 1 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
