*** src/logoi/input/tool/serialise/parse_obj.rs:50:5: replace parse_fields -> Result<(serde_json::Map<String, Value>, Vec<String>), String> with Ok((Default::default(), vec![String::new()]))

*** mutation diff:
--- src/logoi/input/tool/serialise/parse_obj.rs
+++ replace parse_fields -> Result<(serde_json::Map<String, Value>, Vec<String>), String> with Ok((Default::default(), vec![String::new()]))
@@ -42,19 +42,10 @@
     // }
 
     Ok(obj)
 }
 
 fn parse_fields(
     fields: &Vec<FunctionParameter>,
 ) -> Result<(serde_json::Map<String, Value>, Vec<String>), String> {
-    let mut fields_map = serde_json::Map::new();
-    let mut required_params = Vec::new();
-    for param in fields {
-        match insert_param(&mut fields_map, &mut required_params, param) {
-            Ok(_) => (),
-            Err(e) => return Err(e),
-        };
-    }
-
-    Ok((fields_map, required_params))
+    Ok((Default::default(), vec![String::new()])) /* ~ changed by cargo-mutants ~ */
 }

---- map_always_emits_additional_properties stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'map_always_emits_additional_properties' (1937379) panicked at tests/proptest_function_schema.rs:260:9:
assertion `left == right` failed
  left: Null
 right: "object"

thread 'map_always_emits_additional_properties' (1937379) panicked at tests/proptest_function_schema.rs:192:1:
Test failed: assertion `left == right` failed
  left: Null
 right: "object".
minimal failing input: inner = String
	successes: 0

---- oneof_emits_correct_array stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'oneof_emits_correct_array' (1937380) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1937380) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1937380) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1937380) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

---- arbitrary_function_call_serializes_to_valid_schema stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'arbitrary_function_call_serializes_to_valid_schema' (1937377) panicked at tests/proptest_function_schema.rs:161:9:
missing property: d2_yq4 in {"name":"j_bisnz6u_o","parameters":{"properties":{},"required":[""],"type":"object"}}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1937377) panicked at tests/proptest_function_schema.rs:161:9:
missing property: d2_yq4 in {"name":"e_bisnz6u_o","parameters":{"properties":{},"required":[""],"type":"object"}}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1937377) panicked at tests/proptest_function_schema.rs:161:9:
missing property: d2_yq4 in {"name":"c_bisnz6u_o","parameters":{"properties":{},"required":[""],"type":"object"}}

thread 'arbitrary_function

failures:
    arbitrary_function_call_serializes_to_valid_schema
    map_always_emits_additional_properties
    oneof_emits_correct_array

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
