*** src/logoi/input/tool/serialise/parse_obj.rs:9:5: replace insert_obj_into_param_map -> Result<(), String> with Ok(())

*** mutation diff:
--- src/logoi/input/tool/serialise/parse_obj.rs
+++ replace insert_obj_into_param_map -> Result<(), String> with Ok(())
@@ -1,21 +1,17 @@
 use super::parse_param::insert_param;
 use crate::logoi::input::tool::FunctionParameter;
 use serde_json::Value;
 
 pub fn insert_obj_into_param_map(
     param_map: &mut serde_json::Map<String, serde_json::Value>,
     obj: &Vec<FunctionParameter>,
 ) -> Result<(), String> {
-    let obj = parse_obj(obj)?;
-    for (key, value) in obj {
-        param_map.insert(key, value);
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn parse_obj(obj: &Vec<FunctionParameter>) -> Result<serde_json::Map<String, Value>, String> {
     let (fields_map, required_params) = match parse_fields(obj) {
         Ok((fields_map, required_params)) => (fields_map, required_params),
         Err(e) => return Err(e),
     };

---- arbitrary_function_call_serializes_to_valid_schema stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'arbitrary_function_call_serializes_to_valid_schema' (1926725) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1926725) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1926725) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1926725) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

failures:
    arbitrary_function_call_serializes_to_valid_schema

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
