*** src/logoi/input/tool/serialise/parse_param.rs:10:5: replace insert_param -> Result<(), String> with Ok(())

*** mutation diff:
--- src/logoi/input/tool/serialise/parse_param.rs
+++ replace insert_param -> Result<(), String> with Ok(())
@@ -2,26 +2,10 @@
 use crate::logoi::input::tool::{FunctionParameter, FunctionType};
 use serde_json::Map;
 
 pub fn insert_param(
     params_map: &mut Map<String, serde_json::Value>,
     required_params: &mut Vec<String>,
     param: &FunctionParameter,
 ) -> Result<(), String> {
-    let is_optional_type = matches!(param._type, FunctionType::Option(_));
-    if param.required && !is_optional_type {
-        required_params.push(param.name.clone());
-    }
-
-    let mut param_map = serde_json::Map::new();
-    insert_type(&mut param_map, &param._type)?;
-    if let Some(ref description) = param.description {
-        param_map.insert(
-            "description".to_string(),
-            serde_json::Value::String(description.clone()),
-        );
-    }
-
-    params_map.insert(param.name.clone(), serde_json::Value::Object(param_map));
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

---- map_always_emits_additional_properties stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'map_always_emits_additional_properties' (1944805) panicked at tests/proptest_function_schema.rs:260:9:
assertion `left == right` failed
  left: Null
 right: "object"

thread 'map_always_emits_additional_properties' (1944805) panicked at tests/proptest_function_schema.rs:192:1:
Test failed: assertion `left == right` failed
  left: Null
 right: "object".
minimal failing input: inner = String
	successes: 0

---- oneof_emits_correct_array stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'oneof_emits_correct_array' (1944806) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1944806) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1944806) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1944806) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

---- arbitrary_function_call_serializes_to_valid_schema stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'arbitrary_function_call_serializes_to_valid_schema' (1944803) panicked at tests/proptest_function_schema.rs:161:9:
missing property: d2_yq4 in {"name":"j_bisnz6u_o","parameters":{"properties":{},"required":[],"type":"object"}}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1944803) panicked at tests/proptest_function_schema.rs:161:9:
missing property: d2_yq4 in {"name":"e_bisnz6u_o","parameters":{"properties":{},"required":[],"type":"object"}}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1944803) panicked at tests/proptest_function_schema.rs:161:9:
missing property: d2_yq4 in {"name":"c_bisnz6u_o","parameters":{"properties":{},"required":[],"type":"object"}}

thread 'arbitrary_function_call_

failures:
    arbitrary_function_call_serializes_to_valid_schema
    map_always_emits_additional_properties
    oneof_emits_correct_array

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
