*** src/logoi/input/tool/serialise/parse_param.rs:11:23: replace && with || in insert_param

*** mutation diff:
--- src/logoi/input/tool/serialise/parse_param.rs
+++ replace && with || in insert_param
@@ -3,17 +3,17 @@
 use serde_json::Map;
 
 pub fn insert_param(
     params_map: &mut Map<String, serde_json::Value>,
     required_params: &mut Vec<String>,
     param: &FunctionParameter,
 ) -> Result<(), String> {
     let is_optional_type = matches!(param._type, FunctionType::Option(_));
-    if param.required && !is_optional_type {
+    if param.required || /* ~ changed by cargo-mutants ~ */ !is_optional_type {
         required_params.push(param.name.clone());
     }
 
     let mut param_map = serde_json::Map::new();
     insert_type(&mut param_map, &param._type)?;
     if let Some(ref description) = param.description {
         param_map.insert(
             "description".to_string(),

---- required_false_excludes_from_required_array stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'required_false_excludes_from_required_array' (1948696) panicked at tests/proptest_function_schema.rs:239:9:
expected `z_w` not in required, got [String("z_w")]

thread 'required_false_excludes_from_required_array' (1948696) panicked at tests/proptest_function_schema.rs:239:9:
expected `z_w` not in required, got [String("z_w")]

thread 'required_false_excludes_from_required_array' (1948696) panicked at tests/proptest_function_schema.rs:239:9:
expected `z_w` not in required, got [String("z_w")]

thread 'required_false_excludes_from_required_array' (1948696) panicked at tests/proptest_function_schema.rs:239:9:
expected `m_w` not in required, got [String("m_w")]

---- arbitrary_function_call_serializes_to_valid_schema stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'arbitrary_function_call_serializes_to_valid_schema' (1948692) panicked at tests/proptest_function_schema.rs:182:9:
assertion `left == right` failed: required mismatch for ah_i7: expect=false got=true (type optional? false)
  left: false
 right: true

thread 'arbitrary_function_call_serializes_to_valid_schema' (1948692) panicked at tests/proptest_function_schema.rs:182:9:
assertion `left == right` failed: required mismatch for ah_i7: expect=false got=true (type optional? false)
  left: false
 right: true

thread 'arbitrary_function_call_serializes_to_valid_schema' (1948692) panicked at tests/proptest_function_schema.rs:182:9:

failures:
    arbitrary_function_call_serializes_to_valid_schema
    required_false_excludes_from_required_array

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
