*** src/logoi/input/tool/serialise/parse_param.rs:11:26: delete ! in insert_param

*** mutation diff:
--- src/logoi/input/tool/serialise/parse_param.rs
+++ delete ! in insert_param
@@ -3,17 +3,17 @@
 use serde_json::Map;
 
 pub fn insert_param(
     params_map: &mut Map<String, serde_json::Value>,
     required_params: &mut Vec<String>,
     param: &FunctionParameter,
 ) -> Result<(), String> {
     let is_optional_type = matches!(param._type, FunctionType::Option(_));
-    if param.required && !is_optional_type {
+    if param.required &&  /* ~ changed by cargo-mutants ~ */is_optional_type {
         required_params.push(param.name.clone());
     }
 
     let mut param_map = serde_json::Map::new();
     insert_type(&mut param_map, &param._type)?;
     if let Some(ref description) = param.description {
         param_map.insert(
             "description".to_string(),

---- arbitrary_function_call_serializes_to_valid_schema stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'arbitrary_function_call_serializes_to_valid_schema' (1952107) panicked at tests/proptest_function_schema.rs:182:9:
assertion `left == right` failed: required mismatch for stx_m_3v_u9i: expect=true got=false (type optional? false)
  left: true
 right: false

thread 'arbitrary_function_call_serializes_to_valid_schema' (1952107) panicked at tests/proptest_function_schema.rs:182:9:
assertion `left == right` failed: required mismatch for stx_m_3v_u9i: expect=true got=false (type optional? false)
  left: true
 right: false

thread 'arbitrary_function_call_serializes_to_valid_schema' (1952107) panicked at tests/proptest_function_schema.rs:182:9:

failures:
    arbitrary_function_call_serializes_to_valid_schema

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
