*** src/logoi/input/tool/serialise/parse_type.rs:101:5: replace parse_oneof -> Result<(), String> with Ok(())

*** mutation diff:
--- src/logoi/input/tool/serialise/parse_type.rs
+++ replace parse_oneof -> Result<(), String> with Ok(())
@@ -93,28 +93,10 @@
     );
     Ok(())
 }
 
 fn parse_oneof(
     param_map: &mut serde_json::Map<String, serde_json::Value>,
     variants: &[FunctionVariant],
 ) -> Result<(), String> {
-    let mut arr: Vec<Value> = Vec::with_capacity(variants.len());
-    for v in variants {
-        let mut variant_schema = if v.parameters.is_empty() {
-            // unit variant → string const equivalent
-            let mut m = serde_json::Map::new();
-            m.insert("type".into(), json!("string"));
-            m.insert("enum".into(), json!([v.name]));
-            m
-        } else {
-            parse_obj(&v.parameters)?
-        };
-        variant_schema.insert("title".into(), json!(v.name));
-        if let Some(desc) = &v.description {
-            variant_schema.insert("description".into(), json!(desc));
-        }
-        arr.push(serde_json::Value::Object(variant_schema));
-    }
-    param_map.insert("oneOf".into(), serde_json::Value::Array(arr));
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

---- oneof_emits_correct_array stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'oneof_emits_correct_array' (1976198) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1976198) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1976198) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1976198) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

---- arbitrary_function_call_serializes_to_valid_schema stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'arbitrary_function_call_serializes_to_valid_schema' (1976195) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1976195) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1976195) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1976195) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

failures:
    arbitrary_function_call_serializes_to_valid_schema
    oneof_emits_correct_array

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
