*** src/logoi/input/tool/serialise/parse_type.rs:11:5: replace insert_type -> Result<(), String> with Ok(())

*** mutation diff:
--- src/logoi/input/tool/serialise/parse_type.rs
+++ replace insert_type -> Result<(), String> with Ok(())
@@ -3,32 +3,17 @@
 use crate::logoi::input::tool::{EnumValues, FunctionType, FunctionVariant};
 
 use super::parse_obj::{insert_obj_into_param_map, parse_obj};
 
 pub fn insert_type(
     param_map: &mut serde_json::Map<String, serde_json::Value>,
     _type: &FunctionType,
 ) -> Result<(), String> {
-    match _type {
-        FunctionType::Option(_type) => return insert_type(param_map, _type.as_ref()),
-        FunctionType::Enum(values) => insert_enum_type(param_map, values)?,
-        FunctionType::Object(obj) => insert_obj_into_param_map(param_map, obj)?,
-        FunctionType::Array(items) => parse_array(param_map, items)?,
-        FunctionType::Map(value) => parse_map(param_map, value)?,
-        FunctionType::OneOf(variants) => parse_oneof(param_map, variants)?,
-        _type => {
-            param_map.insert(
-                "type".to_string(),
-                serde_json::Value::String(_type.to_string()),
-            );
-        }
-    };
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn insert_enum_type(
     param_map: &mut serde_json::Map<String, serde_json::Value>,
     values: &EnumValues,
 ) -> Result<(), String> {
     param_map.insert(
         "type".to_string(),

---- map_always_emits_additional_properties stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'map_always_emits_additional_properties' (1955544) panicked at tests/proptest_function_schema.rs:260:9:
assertion `left == right` failed
  left: Null
 right: "object"

thread 'map_always_emits_additional_properties' (1955544) panicked at tests/proptest_function_schema.rs:192:1:
Test failed: assertion `left == right` failed
  left: Null
 right: "object".
minimal failing input: inner = String
	successes: 0

---- oneof_emits_correct_array stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'oneof_emits_correct_array' (1955545) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1955545) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1955545) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

thread 'oneof_emits_correct_array' (1955545) panicked at tests/proptest_function_schema.rs:295:14:
called `Option::unwrap()` on a `None` value

---- arbitrary_function_call_serializes_to_valid_schema stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'arbitrary_function_call_serializes_to_valid_schema' (1955542) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1955542) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1955542) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1955542) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

failures:
    arbitrary_function_call_serializes_to_valid_schema
    map_always_emits_additional_properties
    oneof_emits_correct_array

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
