*** src/logoi/input/tool/serialise/parse_type.rs:33:5: replace insert_enum_type -> Result<(), String> with Ok(())

*** mutation diff:
--- src/logoi/input/tool/serialise/parse_type.rs
+++ replace insert_enum_type -> Result<(), String> with Ok(())
@@ -25,39 +25,17 @@
 
     Ok(())
 }
 
 fn insert_enum_type(
     param_map: &mut serde_json::Map<String, serde_json::Value>,
     values: &EnumValues,
 ) -> Result<(), String> {
-    param_map.insert(
-        "type".to_string(),
-        serde_json::Value::String(enum_value_to_string(values)?),
-    );
-    param_map.insert(
-        "enum".to_string(),
-        serde_json::Value::Array(match values {
-            EnumValues::String(values) => values
-                .iter()
-                .map(|v| serde_json::Value::String(v.to_string()))
-                .collect(),
-            EnumValues::Int(values) => values
-                .iter()
-                .map(|v| serde_json::Value::Number(serde_json::Number::from(*v)))
-                .collect(),
-            EnumValues::Float(values) => values
-                .iter()
-                .map(|v| serde_json::Value::Number(serde_json::Number::from_f64(*v).unwrap()))
-                .collect(),
-        }),
-    );
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn enum_value_to_string(_type: &EnumValues) -> Result<String, String> {
     match _type {
         EnumValues::String(_) => Ok("string".to_string()),
         EnumValues::Int(_) => Ok("number".to_string()),
         EnumValues::Float(_) => Ok("number".to_string()),
     }

---- arbitrary_function_call_serializes_to_valid_schema stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'arbitrary_function_call_serializes_to_valid_schema' (1958966) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1958966) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1958966) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1958966) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

failures:
    arbitrary_function_call_serializes_to_valid_schema

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
