*** src/logoi/input/tool/serialise/parse_type.rs:59:5: replace enum_value_to_string -> Result<String, String> with Ok(String::new())

*** mutation diff:
--- src/logoi/input/tool/serialise/parse_type.rs
+++ replace enum_value_to_string -> Result<String, String> with Ok(String::new())
@@ -51,21 +51,17 @@
                 .collect(),
         }),
     );
 
     Ok(())
 }
 
 fn enum_value_to_string(_type: &EnumValues) -> Result<String, String> {
-    match _type {
-        EnumValues::String(_) => Ok("string".to_string()),
-        EnumValues::Int(_) => Ok("number".to_string()),
-        EnumValues::Float(_) => Ok("number".to_string()),
-    }
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_array(
     param_map: &mut serde_json::Map<String, serde_json::Value>,
     items: &FunctionType,
 ) -> Result<(), String> {
     param_map.insert("type".to_string(), json!("array".to_string()));
     param_map.insert(

---- tests::can_correctly_parse_function_definition_with_enum_parameter stdout ----

thread 'tests::can_correctly_parse_function_definition_with_enum_parameter' (1962520) panicked at tests/tool_call_input_parsing.rs:206:9:
assertion `left == right` failed

failures:
    tests::can_correctly_parse_function_definition_with_enum_parameter

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
