*** src/logoi/input/tool/serialise/parse_type.rs:70:5: replace parse_array -> Result<(), String> with Ok(())

*** mutation diff:
--- src/logoi/input/tool/serialise/parse_type.rs
+++ replace parse_array -> Result<(), String> with Ok(())
@@ -62,27 +62,17 @@
         EnumValues::Float(_) => Ok("number".to_string()),
     }
 }
 
 fn parse_array(
     param_map: &mut serde_json::Map<String, serde_json::Value>,
     items: &FunctionType,
 ) -> Result<(), String> {
-    param_map.insert("type".to_string(), json!("array".to_string()));
-    param_map.insert(
-        "items".to_string(),
-        serde_json::Value::Object({
-            let mut items_map = serde_json::Map::new();
-            insert_type(&mut items_map, items)?;
-            items_map
-        }),
-    );
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_map(
     param_map: &mut serde_json::Map<String, serde_json::Value>,
     value: &FunctionType,
 ) -> Result<(), String> {
     param_map.insert("type".to_string(), json!("object"));
     let mut additional = serde_json::Map::new();

---- arbitrary_function_call_serializes_to_valid_schema stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'arbitrary_function_call_serializes_to_valid_schema' (1969404) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1969404) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1969404) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1969404) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

failures:
    arbitrary_function_call_serializes_to_valid_schema

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
