*** src/logoi/input/tool/serialise/parse_type.rs:87:5: replace parse_map -> Result<(), String> with Ok(())

*** mutation diff:
--- src/logoi/input/tool/serialise/parse_type.rs
+++ replace parse_map -> Result<(), String> with Ok(())
@@ -79,24 +79,17 @@
 
     Ok(())
 }
 
 fn parse_map(
     param_map: &mut serde_json::Map<String, serde_json::Value>,
     value: &FunctionType,
 ) -> Result<(), String> {
-    param_map.insert("type".to_string(), json!("object"));
-    let mut additional = serde_json::Map::new();
-    insert_type(&mut additional, value)?;
-    param_map.insert(
-        "additionalProperties".to_string(),
-        serde_json::Value::Object(additional),
-    );
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_oneof(
     param_map: &mut serde_json::Map<String, serde_json::Value>,
     variants: &[FunctionVariant],
 ) -> Result<(), String> {
     let mut arr: Vec<Value> = Vec::with_capacity(variants.len());
     for v in variants {

---- map_always_emits_additional_properties stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'map_always_emits_additional_properties' (1972798) panicked at tests/proptest_function_schema.rs:260:9:
assertion `left == right` failed
  left: Null
 right: "object"

thread 'map_always_emits_additional_properties' (1972798) panicked at tests/proptest_function_schema.rs:192:1:
Test failed: assertion `left == right` failed
  left: Null
 right: "object".
minimal failing input: inner = String
	successes: 0

---- arbitrary_function_call_serializes_to_valid_schema stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'arbitrary_function_call_serializes_to_valid_schema' (1972796) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1972796) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1972796) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

thread 'arbitrary_function_call_serializes_to_valid_schema' (1972796) panicked at tests/proptest_function_schema.rs:133:5:
schema must have `type` or `oneOf`: {}

failures:
    arbitrary_function_call_serializes_to_valid_schema
    map_always_emits_additional_properties

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
